# Point Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionInputPoint..::..Point Property
ConnectionInputPoint Class See Also
---
3d position of this input point.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public XYZ Point { get; set; }
```

Visual Basic
---
```text
Public Property Point As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace